from dataclasses import dataclass


@dataclass
class RA:
    ko = [
        "서울",
        "부산",
        "대구",
        "인천",
        "광주",
        "대전",
        "울산",
        "세종",
        "경기",
        "강원",
        "충북",
        "충남",
        "전북",
        "전남",
        "경북",
        "경남",
        "제주",
    ]
    code = [
        "1100000000",
        "2600000000",
        "2700000000",
        "2800000000",
        "2900000000",
        "3000000000",
        "3100000000",
        "3600000000",
        "4100000000",
        "4200000000",
        "4300000000",
        "4400000000",
        "4500000000",
        "4600000000",
        "4700000000",
        "4800000000",
        "5000000000",
    ]


MMI = ["", "Ⅰ", "Ⅱ", "Ⅲ", "Ⅳ", "Ⅴ", "Ⅵ", "Ⅶ", "Ⅷ", "Ⅸ", "Ⅹ+"]

TIME_ZONE = 9
TZ_MSEC = TIME_ZONE * 3600000

DELAY = 1000
TIDE = DELAY
SIM = False

BIN_PATH = "http://www.weather.go.kr/pews/data/"

MAX_EQK_INFO_LEN = 120
MAX_EQK_STR_LEN = 60
